{
  "date": "Sunday, August 21st",
  "times": {
    "Afternoon": {
      "nodes": [
        {
          "id": "start",
          "title": "An Unexpected Task",
          "content": "You get a call from your teacher, Mr. Harrison. 'Alex, I know it's still summer break, but I need a huge favor. I left some important documents in three different spots around town. Could you possibly pick them up for me before school starts tomorrow? I'll give you extra credit!'"
        },
        {
          "id": "choice_point",
          "title": "Where to go first?",
          "content": "You agree to help. You have a list of three places Mr. Harrison frequented: The Quiet Mug Cafe, the Old Town Library, and the Sunbeam Park bench near the fountain. You can visit them in any order.",
          "type": "choice"
        },
        {
          "id": "cafe1",
          "title": "Visit: The Quiet Mug Cafe",
          "content": "You head to the cafe. The barista, a friendly woman named Chloe, recognizes Mr. Harrison's description. 'Oh, Mr. H! Yes, he left this folder. Said a student named Alex would pick it up.' She hands you a manila folder labeled 'Poetry Analysis'.",
          "sets_flag": "visited_cafe"
        },
        {
          "id": "library1",
          "title": "Visit: Old Town Library",
          "content": "The library is cool and silent. You find the designated study carrel and, just as he said, there's a heavy textbook with a folder sticking out. The label reads 'Historical Timelines'. You quietly take it.",
          "sets_flag": "visited_library"
        },
        {
          "id": "park1",
          "title": "Visit: Sunbeam Park",
          "content": "At the park, you find the bench near the fountain. Tucked underneath is a small, waterproof document bag. You can see a USB drive inside. This must be the third item.",
          "sets_flag": "visited_park"
        },
        {
          "id": "school1",
          "title": "Go to School",
          "content": "With all three items collected, you head to the now-empty school. You use the code Mr. Harrison gave you to enter his classroom and leave the documents safely on his desk. Mission complete! Now you can finally enjoy the last evening of summer."
        }
      ],
      "connections": [
        { "from": "start", "to": "choice_point" },
        { "from": "choice_point", "to": "cafe1" },
        { "from": "choice_point", "to": "library1" },
        { "from": "choice_point", "to": "park1" },
        { 
          "from": "choice_point", "to": "school1",
          "condition": {
            "requires": ["visited_cafe", "visited_library", "visited_park"]
          }
        }
      ]
    }
  }
}
